---
kind: property
id: P:Autodesk.Revit.DB.DocumentSet.IsEmpty
source: html/daf5b070-a712-2808-32a6-2f7206e9b97b.htm
---
# Autodesk.Revit.DB.DocumentSet.IsEmpty Property

Test to see if the set is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the set is empty then True will be returned, otherwise False.